In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [4]:
pd.__version__

'1.1.1'

In [5]:
data=pd.DataFrame(np.random.randint(1,100,(10,10)),columns=list('abcdefghij'))
data

    a   b   c   d   e   f   g   h   i   j
0  56  69  47  67  52  33  52  51  67  54
1  94  19  70  83  81  52  76  21  51  56
2  63   3   1  48  80  10  35  21  10  70
3  27  75  36  54  54  30  64  33  39  34
4  76  27  66  45  46  98  86  36   4  27
5   1  26  91  65  87  19  97  78  67   6
6  64  21   5  26  29  93   1  88  66  63
7  24   4  45  58  11  99  43  19  88  48
8   2   5  59  63  96  41  58   2  22  83
9  56  82   2  92  88  91  72  80  75  84

In [10]:
data=data.astype(str)

In [11]:
data[data.a.str.contains('4')]

    a   b   c   d   e   f   g   h   i   j
1  94  19  70  83  81  52  76  21  51  56
6  64  21   5  26  29  93   1  88  66  63
7  24   4  45  58  11  99  43  19  88  48

In [15]:
data=data.astype(int)

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       10 non-null     int32
 1   b       10 non-null     int32
 2   c       10 non-null     int32
 3   d       10 non-null     int32
 4   e       10 non-null     int32
 5   f       10 non-null     int32
 6   g       10 non-null     int32
 7   h       10 non-null     int32
 8   i       10 non-null     int32
 9   j       10 non-null     int32
dtypes: int32(10)
memory usage: 528.0 bytes

In [19]:
data.describe()

,a,b,c,d,e,f,g,h,i,j
count,10.000000,10.00000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,46.300000,33.10000,42.200000,60.100000,62.400000,56.600000,58.400000,42.900000,48.900000,52.500000
std,31.308678,30.57032,31.215381,18.858832,28.383094,35.173222,27.685536,29.920079,28.892329,24.784628
min,1.000000,3.00000,1.000000,26.000000,11.000000,10.000000,1.000000,2.000000,4.000000,6.000000
25%,24.750000,8.50000,12.750000,49.500000,47.500000,30.750000,45.250000,21.000000,26.250000,37.500000
50%,56.000000,23.50000,46.000000,60.500000,67.000000,46.500000,61.000000,34.500000,58.500000,55.000000
75%,63.750000,58.50000,64.250000,66.500000,85.500000,92.500000,75.000000,71.250000,67.000000,68.250000
max,94.000000,82.00000,91.000000,92.000000,96.000000,99.000000,97.000000,88.000000,88.000000,84.000000

In [20]:
data.replace(88,np.nan,inplace=True)

In [24]:
data=data.astype(float)

In [25]:
data

      a     b     c     d     e     f     g     h     i     j
0  56.0  69.0  47.0  67.0  52.0  33.0  52.0  51.0  67.0  54.0
1  94.0  19.0  70.0  83.0  81.0  52.0  76.0  21.0  51.0  56.0
2  63.0   3.0   1.0  48.0  80.0  10.0  35.0  21.0  10.0  70.0
3  27.0  75.0  36.0  54.0  54.0  30.0  64.0  33.0  39.0  34.0
4  76.0  27.0  66.0  45.0  46.0  98.0  86.0  36.0   4.0  27.0
5   1.0  26.0  91.0  65.0  87.0  19.0  97.0  78.0  67.0   6.0
6  64.0  21.0   5.0  26.0  29.0  93.0   1.0   NaN  66.0  63.0
7  24.0   4.0  45.0  58.0  11.0  99.0  43.0  19.0   NaN  48.0
8   2.0   5.0  59.0  63.0  96.0  41.0  58.0   2.0  22.0  83.0
9  56.0  82.0   2.0  92.0   NaN  91.0  72.0  80.0  75.0  84.0

In [27]:
data[data.h.isnull()]

      a     b    c     d     e     f    g   h     i     j
6  64.0  21.0  5.0  26.0  29.0  93.0  1.0 NaN  66.0  63.0

In [28]:
data['new']=data.a+data.b

In [30]:
data

      a     b     c     d     e     f     g     h     i     j    new
0  56.0  69.0  47.0  67.0  52.0  33.0  52.0  51.0  67.0  54.0  125.0
1  94.0  19.0  70.0  83.0  81.0  52.0  76.0  21.0  51.0  56.0  113.0
2  63.0   3.0   1.0  48.0  80.0  10.0  35.0  21.0  10.0  70.0   66.0
3  27.0  75.0  36.0  54.0  54.0  30.0  64.0  33.0  39.0  34.0  102.0
4  76.0  27.0  66.0  45.0  46.0  98.0  86.0  36.0   4.0  27.0  103.0
5   1.0  26.0  91.0  65.0  87.0  19.0  97.0  78.0  67.0   6.0   27.0
6  64.0  21.0   5.0  26.0  29.0  93.0   1.0   NaN  66.0  63.0   85.0
7  24.0   4.0  45.0  58.0  11.0  99.0  43.0  19.0   NaN  48.0   28.0
8   2.0   5.0  59.0  63.0  96.0  41.0  58.0   2.0  22.0  83.0    7.0
9  56.0  82.0   2.0  92.0   NaN  91.0  72.0  80.0  75.0  84.0  138.0

In [33]:
data.drop_duplicates()

      a     b     c     d     e     f     g     h     i     j    new
0  56.0  69.0  47.0  67.0  52.0  33.0  52.0  51.0  67.0  54.0  125.0
1  94.0  19.0  70.0  83.0  81.0  52.0  76.0  21.0  51.0  56.0  113.0
2  63.0   3.0   1.0  48.0  80.0  10.0  35.0  21.0  10.0  70.0   66.0
3  27.0  75.0  36.0  54.0  54.0  30.0  64.0  33.0  39.0  34.0  102.0
4  76.0  27.0  66.0  45.0  46.0  98.0  86.0  36.0   4.0  27.0  103.0
5   1.0  26.0  91.0  65.0  87.0  19.0  97.0  78.0  67.0   6.0   27.0
6  64.0  21.0   5.0  26.0  29.0  93.0   1.0   NaN  66.0  63.0   85.0
7  24.0   4.0  45.0  58.0  11.0  99.0  43.0  19.0   NaN  48.0   28.0
8   2.0   5.0  59.0  63.0  96.0  41.0  58.0   2.0  22.0  83.0    7.0
9  56.0  82.0   2.0  92.0   NaN  91.0  72.0  80.0  75.0  84.0  138.0

In [34]:
list(data.a.unique())

[56.0, 94.0, 63.0, 27.0, 76.0, 1.0, 64.0, 24.0, 2.0]

In [35]:
data.a.unique()

array([56., 94., 63., 27., 76.,  1., 64., 24.,  2.])

In [43]:
data.sum()

a      463.0
b      331.0
c      422.0
d      601.0
e      536.0
f      566.0
g      584.0
h      341.0
i      401.0
j      525.0
new    794.0
dtype: float64

In [57]:
bins=[2,50,100]
data['rank']=pd.cut(data.a,bins,labels=['左','右'])
data

      a     b     c     d     e     f     g     h     i     j    new rank
0  56.0  69.0  47.0  67.0  52.0  33.0  52.0  51.0  67.0  54.0  125.0    右
1  94.0  19.0  70.0  83.0  81.0  52.0  76.0  21.0  51.0  56.0  113.0    右
2  63.0   3.0   1.0  48.0  80.0  10.0  35.0  21.0  10.0  70.0   66.0    右
3  27.0  75.0  36.0  54.0  54.0  30.0  64.0  33.0  39.0  34.0  102.0    左
4  76.0  27.0  66.0  45.0  46.0  98.0  86.0  36.0   4.0  27.0  103.0    右
5   1.0  26.0  91.0  65.0  87.0  19.0  97.0  78.0  67.0   6.0   27.0  NaN
6  64.0  21.0   5.0  26.0  29.0  93.0   1.0   NaN  66.0  63.0   85.0    右
7  24.0   4.0  45.0  58.0  11.0  99.0  43.0  19.0   NaN  48.0   28.0    左
8   2.0   5.0  59.0  63.0  96.0  41.0  58.0   2.0  22.0  83.0    7.0  NaN
9  56.0  82.0   2.0  92.0   NaN  91.0  72.0  80.0  75.0  84.0  138.0    右

In [62]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                               '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [63]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [64]:
temp=df.From_To.str.split('_',expand=True)
temp.columns=['from','to']
df=pd.concat([df,temp],axis=1)
df

,From_To,FlightNumber,RecentDelays,Airline,from,to
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [66]:
df.drop('From_To',axis=1,inplace=True)
df

   FlightNumber  RecentDelays              Airline      from         to
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [69]:
df['from'] = df['from'].str.capitalize()
df

   FlightNumber  RecentDelays              Airline      from         to
0         10045      [23, 47]               KLM(!)    London      paris
1         10055            []    <Air France> (12)    Madrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    London  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [70]:
df['to']=df['to'].str.upper()
df

   FlightNumber  RecentDelays              Airline      from         to
0         10045      [23, 47]               KLM(!)    London      PARIS
1         10055            []    <Air France> (12)    Madrid      MILAN
2         10065  [24, 43, 87]  (British Airways. )    London  STOCKHOLM
3         10075          [13]       12. Air France  Budapest      PARIS
4         10085      [67, 32]          "Swiss Air"  Brussels     LONDON

In [71]:
df['Airline'] = df['Airline'].str.extract('([a-zA-Z\s]+)', expand=False).str.strip()
df

   FlightNumber  RecentDelays          Airline      from         to
0         10045      [23, 47]              KLM    London      PARIS
1         10055            []       Air France    Madrid      MILAN
2         10065  [24, 43, 87]  British Airways    London  STOCKHOLM
3         10075          [13]       Air France  Budapest      PARIS
4         10085      [67, 32]        Swiss Air  Brussels     LONDON